MCLEANS/STM32F4_PWM_CONFIGURATION/IMPLEMENTATION/src/main.cpp
/**
  ******************************************************************************
  * @file    main.c
  * @author  Ac6
  * @version V1.0
  * @date    01-December-2013
  * @brief   Default main function.
  ******************************************************************************
*/


#include "stm32f4xx.h"
#include "clockconfig.h"
#include "PWM.h"
			

int duty_cycle = 50;

custom_libraries::channel pwm_channel = custom_libraries::channel1;
custom_libraries::alternate_function af = custom_libraries::AF0;

custom_libraries::clock_config system_clock;

//custom_libraries::PWM pwm(TIM1,GPIOA,8,)

int main(void)
{


	//---------Configure PLL 168MHz as clock source-------------
	system_clock.initialize();

	//Enable timer 1 RCC
	RCC->APB2ENR |= RCC_APB2ENR_TIM1EN;
	//Enable output port RCC
	RCC->AHB1ENR |= RCC_AHB1ENR_GPIOAEN;
	//Set alternate function mode PA8
	GPIOA->MODER |= GPIO_MODER_MODER8_1;
	//set the specific alternate function
	GPIOA->AFR[1] |= (1<<0);
	GPIOA->AFR[1] &= ~(1<<1);
	GPIOA->AFR[1] &= ~(1<<2);
	GPIOA->AFR[1] &= ~(1<<3);

	//Set prescaler
	TIM1->PSC = 1000;
	//Set ARR
	TIM1->ARR = 100;
	//Set duty cycle
	TIM1->CCR1 = duty_cycle;

	//Set the output compare mode to PWM Mode 1
	TIM1->CCMR1 &= ~(TIM_CCMR1_OC1M_0);
	TIM1->CCMR1 |= TIM_CCMR1_OC1M_1;
	TIM1->CCMR1 |= TIM_CCMR1_OC1M_2;

	//Set output compare preload enable
	TIM1->CCMR1 |= TIM_CCMR1_OC1PE;

	//Enable capture/compare output
	TIM1->CCER |= TIM_CCER_CC1E;

	//set main Output Enable
	TIM1->BDTR |= TIM_BDTR_MOE;

	//Enable the UG bit to update preload register
	TIM1->EGR |= TIM_EGR_UG;


	//Enable timer 1
	TIM1->CR1 |= TIM_CR1_CEN;


	while(1){



	}
}
